HaiRieu/intern_project/lib/ESP32-BLE-Gamepad/BleGamepad.cpp
#include <NimBLEDevice.h>
#include <NimBLEUtils.h>
#include <NimBLEServer.h>
#include "NimBLEHIDDevice.h"
#include "HIDTypes.h"
#include "HIDKeyboardTypes.h"
#include <driver/adc.h>
#include "sdkconfig.h"

#include "BleConnectionStatus.h"
#include "BleGamepad.h"
#include "BleGamepadConfiguration.h"

#include <stdexcept>

#if defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define LOG_TAG "BLEGamepad"
#else
#include "esp_log.h"
static const char *LOG_TAG = "BLEGamepad";
#endif
#include <esp_mac.h>

#define SERVICE_UUID_DEVICE_INFORMATION        "180A"      // Service - Device information

#define CHARACTERISTIC_UUID_MODEL_NUMBER       "2A24"      // Characteristic - Model Number String - 0x2A24
#define CHARACTERISTIC_UUID_SOFTWARE_REVISION  "2A28"      // Characteristic - Software Revision String - 0x2A28
#define CHARACTERISTIC_UUID_SERIAL_NUMBER      "2A25"      // Characteristic - Serial Number String - 0x2A25
#define CHARACTERISTIC_UUID_FIRMWARE_REVISION  "2A26"      // Characteristic - Firmware Revision String - 0x2A26
#define CHARACTERISTIC_UUID_HARDWARE_REVISION  "2A27"      // Characteristic - Hardware Revision String - 0x2A27
#define SENSORS_SERVICE_UUID             "ED38FBD9-3657-4BE3-BF5E-3AB5D29818D8"
#define SENSORS_IMU1RAW_UUID    "55A58E5B-9F51-47DC-B6C7-EE929BA79664"
#define SENSORS_IMU2RAW_UUID    "84b70b01-8869-4a23-ab4f-fbfd1a25a925"
#define SENSORS_IMU1FUSE_CALISTATUS_UUID    "5ABB059E-C70F-4E49-9C9D-16D546404E36"
#define SENSORS_IMU2FUSE_CALISTATUS_UUID    "83370305-9668-44d5-b14d-7f1f480d6f17"
#define SENSORS_FLEXSENSOR_DATA_UUID    "9FE3F26A-8A04-4DB5-A97F-B24DCED652F9"
#define SENSORS_FORCESENSOR_DATA_UUID    "f1461563-772e-43d4-ab00-8d2ac54c94f9"
#define SENSORS_OVERALL_STATUS_UUID    "b840e25c-183a-4a7e-8ec6-9a29ecc7ffdb"
#define SENSORS_CONFIG_UUID    "289f76d8-2edb-455d-8c3c-aabb42ab5b5c"
#define SENSORS_UNIX_TIME_UUID    "7AE63A01-7AD5-464B-803D-8A392D242CC7"
#define GAMEPAD_SERVICE_UUID            "aade5d3b-2717-4903-8ed8-7544b47d1fc0"
#define GAMEPAD_JOYSTICK_UUID             "c91e9c03-b4be-4bb2-a2a2-21f52353265a"
#define GAMEPAD_BUTTONS_UUID             "34afe3d1-643e-4fe7-abd2-7e7a0cfb1601"



uint8_t tempHidReportDescriptor[150];
int hidReportDescriptorSize = 0;
uint8_t reportSize = 0;
uint8_t numOfButtonBytes = 0;
uint16_t vid;
uint16_t pid;
uint16_t guidVersion;
uint16_t axesMin;
uint16_t axesMax;
uint16_t simulationMin;
uint16_t simulationMax;
std::string modelNumber;
std::string softwareRevision;
std::string serialNumber;
std::string firmwareRevision;
std::string hardwareRevision;

bool enableOutputReport = false;
uint16_t outputReportLength = 64;

BleGamepad::BleGamepad(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel, uint8_t batteryChargeStatus) : _buttons(),
                                                                                                       _specialButtons(0),
                                                                                                       _x(0),
                                                                                                       _y(0),
                                                                                                       _z(0),
                                                                                                       _rZ(0),
                                                                                                       _rX(0),
                                                                                                       _rY(0),
                                                                                                       _slider1(0),
                                                                                                       _slider2(0),
                                                                                                       _rudder(0),
                                                                                                       _throttle(0),
                                                                                                       _accelerator(0),
                                                                                                       _brake(0),
                                                                                                       _steering(0),
                                                                                                       _hat1(0),
                                                                                                       _hat2(0),
                                                                                                       _hat3(0),
                                                                                                       _hat4(0),
                                                                                                       hid(0)
{
    this->resetButtons();
    this->deviceName = deviceName;
    this->deviceManufacturer = deviceManufacturer;
    this->batteryLevel = batteryLevel;
    this->batteryChargeStatus = batteryChargeStatus;
    this->connectionStatus = new BleConnectionStatus();
}

void BleGamepad::resetButtons()
{
    memset(&_buttons, 0, sizeof(_buttons));
}

void BleGamepad::begin(BleGamepadConfiguration *config)
{
    configuration = *config; // we make a copy, so the user can't change actual values midway through operation, without calling the begin function again

    modelNumber = configuration.getModelNumber();
    softwareRevision = configuration.getSoftwareRevision();
    serialNumber = configuration.getSerialNumber();
    firmwareRevision = configuration.getFirmwareRevision();
    hardwareRevision = configuration.getHardwareRevision();

	vid = configuration.getVid();
	pid = configuration.getPid();
	guidVersion = configuration.getGuidVersion();

    enableOutputReport = configuration.getEnableOutputReport();
    outputReportLength = configuration.getOutputReportLength();
    
