HaiRieu/intern_project/lib/ESP32-BLE-Gamepad/BleGamepad.cpp
    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRightThumb(int16_t z, int16_t rZ)
{
    if (z == -32768)
    {
        z = -32767;
    }
    if (rZ == -32768)
    {
        rZ = -32767;
    }

    _z = z;
    _rZ = rZ;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setLeftTrigger(int16_t rX)
{
    if (rX == -32768)
    {
        rX = -32767;
    }

    _rX = rX;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRightTrigger(int16_t rY)
{
    if (rY == -32768)
    {
        rY = -32767;
    }

    _rY = rY;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setTriggers(int16_t rX, int16_t rY)
{
    if (rX == -32768)
    {
        rX = -32767;
    }
    if (rY == -32768)
    {
        rY = -32767;
    }

    _rX = rX;
    _rY = rY;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat(signed char hat)
{
    _hat1 = hat;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat1(signed char hat1)
{
    _hat1 = hat1;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat2(signed char hat2)
{
    _hat2 = hat2;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat3(signed char hat3)
{
    _hat3 = hat3;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setHat4(signed char hat4)
{
    _hat4 = hat4;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setX(int16_t x)
{
    if (x == -32768)
    {
        x = -32767;
    }

    _x = x;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setY(int16_t y)
{
    if (y == -32768)
    {
        y = -32767;
    }

    _y = y;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setZ(int16_t z)
{
    if (z == -32768)
    {
        z = -32767;
    }

    _z = z;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRZ(int16_t rZ)
{
    if (rZ == -32768)
    {
        rZ = -32767;
    }

    _rZ = rZ;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRX(int16_t rX)
{
    if (rX == -32768)
    {
        rX = -32767;
    }

    _rX = rX;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRY(int16_t rY)
{
    if (rY == -32768)
    {
        rY = -32767;
    }

    _rY = rY;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setSlider(int16_t slider)
{
    if (slider == -32768)
    {
        slider = -32767;
    }

    _slider1 = slider;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setSlider1(int16_t slider1)
{
    if (slider1 == -32768)
    {
        slider1 = -32767;
    }

    _slider1 = slider1;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setSlider2(int16_t slider2)
{
    if (slider2 == -32768)
    {
        slider2 = -32767;
    }

    _slider2 = slider2;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setRudder(int16_t rudder)
{
    if (rudder == -32768)
    {
        rudder = -32767;
    }

    _rudder = rudder;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setThrottle(int16_t throttle)
{
    if (throttle == -32768)
    {
        throttle = -32767;
    }

    _throttle = throttle;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setAccelerator(int16_t accelerator)
{
    if (accelerator == -32768)
    {
        accelerator = -32767;
    }

    _accelerator = accelerator;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setBrake(int16_t brake)
{
    if (brake == -32768)
    {
        brake = -32767;
    }

    _brake = brake;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

void BleGamepad::setSteering(int16_t steering)
{
    if (steering == -32768)
    {
        steering = -32767;
    }

    _steering = steering;

    if (configuration.getAutoReport())
    {
        sendReport();
    }
}

bool BleGamepad::isPressed(uint8_t b)
{
    uint8_t index = (b - 1) / 8;
    uint8_t bit = (b - 1) % 8;
    uint8_t bitmask = (1 << bit);

    if ((bitmask & _buttons[index]) > 0)
        return true;
    return false;
}

bool BleGamepad::isConnected(void)
{
    return this->connectionStatus->connected;
}

void BleGamepad::setBatteryLevel(uint8_t level)
{
    this->batteryLevel = level;
    if (hid != 0)
    {
        
        this->hid->setBatteryLevel(this->batteryLevel,this->isConnected()?true:false);

        if (configuration.getAutoReport())
        {
            sendReport();
        }
    }
}
//custom function
/*  @brief set battery charge status
    @param[in] uint8_t state: battery charge status
    @return none
*/
void BleGamepad::setBatteryChargeStatus(uint8_t state)
{
    this->batteryChargeStatus = state;
    if (hid != 0)
    {
        this->hid->setBatteryChargeStatus(this->batteryChargeStatus,this->isConnected()?true:false);
        if (configuration.getAutoReport())
        {
            sendReport();
        }
    }
}
/*  @brief check if output received
    @param none
    @return bool: true if output received, false otherwise
*/
bool BleGamepad::isOutputReceived(){
    if(enableOutputReport && outputReceiver){
        if(this->outputReceiver->outputFlag){
            this->outputReceiver->outputFlag=false; // Clear Flag
            return true;
        }
    }
    return false;
}
/*  @brief get output buffer
    @param none
    @return uint8_t*: output buffer
*/
uint8_t* BleGamepad::getOutputBuffer(){
    if(enableOutputReport && outputReceiver){
        memcpy(outputBackupBuffer, outputReceiver->outputBuffer, outputReportLength); // Creating a backup to avoid buffer being overwritten while processing data
        return outputBackupBuffer;
    }
    return nullptr;
}
/*  @brief custom characteristic callback
    @param[in] NimBLECharacteristic* pCharacteristic: characteristic
    @param[in] NimBLEConnInfo& connInfo: connection info
    @return none
*/
class CustomCharacteristicCallbacks: public NimBLECharacteristicCallbacks {
    private:
    BleGamepad *bleGamepad; // Pointer to BleGamepad instance
    public:
    //constructor
    CustomCharacteristicCallbacks(BleGamepad* instance): bleGamepad(instance){
    }

    void onWrite(NimBLECharacteristic* pCharacteristic, NimBLEConnInfo& connInfo) {
        Serial.println("onWrite callback triggered");
        NimBLEAttValue value = pCharacteristic->getValue();
        Serial.println("getValue() not error");
        if ((pCharacteristic->getUUID().toString() == SENSORS_CONFIG_UUID))
        {
            Serial.println("onWrite callback for sensor config");
            bleGamepad->isOnWriteConfig = 1;
           // Serial.println(bleGamepad->isOnWriteConfig);
            if (value.length() == 15)
            {  
              //  Serial.println(value.length());
                bleGamepad->isRightSize = 1;
            }
            else 
            {
                bleGamepad->isRightSize = 0;
            }
        }
        else if ((pCharacteristic->getUUID().toString() == SENSORS_UNIX_TIME_UUID))
        {
            Serial.println("onWrite callback for UNIX time");
            bleGamepad->isOnWriteUinixTime = 1;
            if (value.length() == 8)
            {
                bleGamepad->isRightSize = 1;
            }
            else
            {
                bleGamepad->isRightSize = 0;
            }
        }
    }
    void onRead(NimBLECharacteristic* pCharacteristic, NimBLEConnInfo& connInfo)
    {
        if((pCharacteristic->getUUID().toString() == SENSORS_CONFIG_UUID)){
            Serial.println("onRead callback for sensor config");
            bleGamepad->isOnReadConfig = 1;
        }
        else if((pCharacteristic->getUUID().toString() == SENSORS_UNIX_TIME_UUID)){
            Serial.println("onRead callback for UNIX time");
            bleGamepad->isOnReadUinixTime = 1;
        }
    }
};
