HaiRieu/intern_project/lib/ESP32-BLE-Gamepad/BleGamepad.cpp
void BleGamepad::resetFlagsWrite()
{
    isOnWriteConfig = 0;
    isOnWriteUinixTime = 0;
    isRightSize = 0;
}
void BleGamepad::resetFlagsRead()
{
    isOnReadConfig = 0;
    isOnReadUinixTime = 0;
}
/*
void BleGamepad::setCustomCharacteristic2(uint32_t value)
{
    if (customCharacteristic2 != NULL) {
        //Serial.println("Custom Characteristic");
        customCharacteristic2->setValue(value);
        customCharacteristic2->notify();
    }
    else {
        Serial.println("Custom Characteristic2 not initialized");
    }
    
}

uint32_t BleGamepad::getCustomCharacteristic1()
{
    if (customCharacteristic1 != NULL) {
        
        return customCharacteristic1->getValue();
    }
    else {
        Serial.println("Custom Characteristic1 not initialized");
        return 0;
    }
}

void BleGamepad::setCustomCharacteristic1(uint32_t value)
{
    if (customCharacteristic1 != NULL) {
        //Serial.println("Custom Characteristic");
        customCharacteristic1->setValue(value);
        customCharacteristic1->notify();
    }
    else {
        Serial.println("Custom Characteristic1 not initialized");
    }
    
}

uint32_t BleGamepad::getCustomCharacteristic2()
{
    if (customCharacteristic2 != NULL) {
        return customCharacteristic2->getValue();
    }
    else {
        Serial.println("Custom Characteristic2 not initialized");
        return 0;
    }
}
*/

/*  @brief set character data
    @param[in] NimBLECharacteristic *character: characteristic
    @param[in] uint8_t *data: data
    @param[in] uint8_t length: length
    @return none
*/
void BleGamepad::setterCharacterData(NimBLECharacteristic *character, uint8_t *data, uint8_t length)
{
    if (character != NULL)
    {
        character->setValue(data, length);
        if(isConnected()){
            character->notify();
        }
    }
    else
    {
        Serial.println("Character not initialized");
    }
}
/*  @brief set UNIX time
    @param[in] uint8_t *data: data
    @param[in] uint8_t length: length
    @return none
*/
void BleGamepad::setUNIXTime(uint8_t *data, uint8_t length)
{
    if(UNIXTime != NULL){
        UNIXTime->setValue(data, length);
    }
    else{
        Serial.println("UNIXTime not initialized");
    }
}
/*  @brief get character data
    @param[in] NimBLECharacteristic *character: characteristic
    @param[out] uint8_t *data: data
    @return none
*/
void BleGamepad::getcharacterData(NimBLECharacteristic *character, uint8_t *data)
{
    if (character != NULL)
    {
        std::string value = character->getValue();
        if (value.length() > 0)
        {
            // if(value.length != data.length){
            //     Serial.println("Data length mismatch");
            //     return;
            // }
            for (int i = 0; i < value.length(); i++)
            {
                data[i] = (uint8_t)value[i];
            }
        }
        else
        {
            Serial.println("Empty value received");
        }
    }
    else
    {
        Serial.println("Character not initialized");
        return;
    }
}

void BleGamepad::taskServer(void *pvParameter)
{
    BleGamepad *BleGamepadInstance = (BleGamepad *)pvParameter; // static_cast<BleGamepad *>(pvParameter);

    // Use the procedure below to set a custom Bluetooth MAC address
    // Compiler adds 0x02 to the last value of board's base MAC address to get the BT MAC address, so take 0x02 away from the value you actually want when setting
    //uint8_t newMACAddress[] = {0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0xFF - 0x02};
    //esp_base_mac_addr_set(&newMACAddress[0]); // Set new MAC address 
    
    NimBLEDevice::init(BleGamepadInstance->deviceName);
    NimBLEServer *pServer = NimBLEDevice::createServer();
    pServer->setCallbacks(BleGamepadInstance->connectionStatus);

    BleGamepadInstance->hid = new NimBLEHIDDevice(pServer);

    BleGamepadInstance->inputGamepad = BleGamepadInstance->hid->getInputReport(BleGamepadInstance->configuration.getHidReportId()); // <-- input REPORTID from report map
    BleGamepadInstance->connectionStatus->inputGamepad = BleGamepadInstance->inputGamepad;

    if (enableOutputReport){
        BleGamepadInstance->outputGamepad = BleGamepadInstance->hid->getOutputReport(BleGamepadInstance->configuration.getHidReportId());
        BleGamepadInstance->outputReceiver = new BleOutputReceiver(outputReportLength);
        BleGamepadInstance->outputBackupBuffer = new uint8_t[outputReportLength];
        BleGamepadInstance->outputGamepad->setCallbacks(BleGamepadInstance->outputReceiver);
    }

    BleGamepadInstance->hid->setManufacturer(BleGamepadInstance->deviceManufacturer);
    //add sensor service
    NimBLEService *sensorService = pServer->createService(SENSORS_SERVICE_UUID);
    NimBLECharacteristic *IMU1RawData = sensorService->createCharacteristic(
        SENSORS_IMU1RAW_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->IMU1RawData = IMU1RawData;
    NimBLECharacteristic *IMU2RawData = sensorService->createCharacteristic(
        SENSORS_IMU2RAW_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->IMU2RawData = IMU2RawData;
    NimBLECharacteristic *IMU1FuseCalStatus = sensorService->createCharacteristic(
        SENSORS_IMU1FUSE_CALISTATUS_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->IMU1FuseDataCaliStatus = IMU1FuseCalStatus;
    NimBLECharacteristic *IMU2FuseCalStatus = sensorService->createCharacteristic(
        SENSORS_IMU2FUSE_CALISTATUS_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->IMU2FuseDataCaliStatus = IMU2FuseCalStatus;
    NimBLECharacteristic *FlexSensorData = sensorService->createCharacteristic(
        SENSORS_FLEXSENSOR_DATA_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->FlexSensorData = FlexSensorData;
    NimBLECharacteristic *ForceSensorData = sensorService->createCharacteristic(
        SENSORS_FORCESENSOR_DATA_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->ForceSensorData = ForceSensorData;

    NimBLECharacteristic *OverallStatus = sensorService->createCharacteristic(
        SENSORS_OVERALL_STATUS_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->OverallStatus = OverallStatus;
    NimBLECharacteristic *Config = sensorService->createCharacteristic(
        SENSORS_CONFIG_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY | NIMBLE_PROPERTY::WRITE
    );
    BleGamepadInstance->Config = Config;


    NimBLECharacteristic *UNIXTime = sensorService->createCharacteristic(
        SENSORS_UNIX_TIME_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->UNIXTime = UNIXTime;


