HaiRieu/intern_project/lib/ESP32-BLE-Gamepad/BleGamepad.cpp
    //add gamepad service
    NimBLEService *gamepadService = pServer->createService(GAMEPAD_SERVICE_UUID);
    NimBLECharacteristic *Joystick = gamepadService->createCharacteristic(
        GAMEPAD_JOYSTICK_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->Joystick = Joystick;
    NimBLECharacteristic *Buttons = gamepadService->createCharacteristic(
        GAMEPAD_BUTTONS_UUID,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
    );
    BleGamepadInstance->Buttons = Buttons;

    //custom service
    // NimBLEService *customService = pServer->createService(CUSTOM_SERVICE_UUID);
    // NimBLECharacteristic *customCharacteristic1 = customService->createCharacteristic(
    //     CUSTOM_CHARACTERISTIC_UUID_1,
    //     NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::NOTIFY
    // );
    // customCharacteristic1->setValue("Initial Value 1");
    // BleGamepadInstance->customCharacteristic1 = customCharacteristic1;

    // NimBLECharacteristic *customCharacteristic2 = customService->createCharacteristic(
    //     CUSTOM_CHARACTERISTIC_UUID_2,
    //     NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::NOTIFY
    // );
    // BleGamepadInstance->customCharacteristic2 = customCharacteristic2;
    //customCharacteristic2->setValue("Initial Value 2");
    NimBLEService *pService = pServer->getServiceByUUID(SERVICE_UUID_DEVICE_INFORMATION);
	
	BLECharacteristic* pCharacteristic_Model_Number = pService->createCharacteristic(
      CHARACTERISTIC_UUID_MODEL_NUMBER,
      NIMBLE_PROPERTY::READ
    );
    pCharacteristic_Model_Number->setValue(modelNumber);
	
	BLECharacteristic* pCharacteristic_Software_Revision = pService->createCharacteristic(
      CHARACTERISTIC_UUID_SOFTWARE_REVISION,
      NIMBLE_PROPERTY::READ
    );
    pCharacteristic_Software_Revision->setValue(softwareRevision);
	
	BLECharacteristic* pCharacteristic_Serial_Number = pService->createCharacteristic(
      CHARACTERISTIC_UUID_SERIAL_NUMBER,
      NIMBLE_PROPERTY::READ
    );
    pCharacteristic_Serial_Number->setValue(serialNumber);
	
	BLECharacteristic* pCharacteristic_Firmware_Revision = pService->createCharacteristic(
      CHARACTERISTIC_UUID_FIRMWARE_REVISION,
      NIMBLE_PROPERTY::READ
    );
    pCharacteristic_Firmware_Revision->setValue(firmwareRevision);
	
	BLECharacteristic* pCharacteristic_Hardware_Revision = pService->createCharacteristic(
      CHARACTERISTIC_UUID_HARDWARE_REVISION,
      NIMBLE_PROPERTY::READ
    );
    pCharacteristic_Hardware_Revision->setValue(hardwareRevision);

    BleGamepadInstance->hid->setPnp(0x01, vid, pid, guidVersion);
    BleGamepadInstance->hid->setHidInfo(0x00, 0x01);

	// NimBLEDevice::setSecurityAuth(BLE_SM_PAIR_AUTHREQ_BOND);
	NimBLEDevice::setSecurityAuth(true, false, false); // enable bonding, no MITM, no SC

    uint8_t *customHidReportDescriptor = new uint8_t[hidReportDescriptorSize];
    memcpy(customHidReportDescriptor, tempHidReportDescriptor, hidReportDescriptorSize);

    // Testing
    //for (int i = 0; i < hidReportDescriptorSize; i++)
    //    Serial.printf("%02x", customHidReportDescriptor[i]);
    //setcall back for onWrite event
    //customCharacteristic1 -> setCallbacks(new CustomCharacteristicCallbacks());
    Config->setCallbacks(new CustomCharacteristicCallbacks(BleGamepadInstance));
    // UNIXTime->setCallbacks(new CustomCharacteristicCallbacks());
    BleGamepadInstance->hid->setReportMap((uint8_t *)customHidReportDescriptor, hidReportDescriptorSize);
    BleGamepadInstance->hid->startServices();

    BleGamepadInstance->onStarted(pServer);
    //test change advertising function
    NimBLEAdvertising *pAdvertising = pServer->getAdvertising();
    pAdvertising->setName("alohaaa");
    pAdvertising->setAppearance(HID_GAMEPAD);
    pAdvertising->addServiceUUID(BleGamepadInstance->hid->getHidService()->getUUID());
    pAdvertising->addServiceUUID(sensorService->getUUID());
    pAdvertising->addServiceUUID(gamepadService->getUUID());
    pAdvertising->setMinInterval(320); //200ms
    pAdvertising->setMaxInterval(800); //500ms
    sensorService->start();
    gamepadService->start();
    pAdvertising->start();
    BleGamepadInstance->hid->setBatteryLevel(BleGamepadInstance->batteryLevel);
    // BleGamepadInstance->hid->setBatteryChargeStatus(BleGamepadInstance->batteryChargeStatus);
    ESP_LOGD(LOG_TAG, "Advertising started!");
    vTaskDelay(portMAX_DELAY); // delay(portMAX_DELAY);
}

